package exam_one;

public class ClassX {
    /*
    44. შექმენით რაღაც x მეთოდი რომელსაც ექნება ორი მანდატორი პარამეტრი საწყისი ფასი და ფასდაკლების პროცენტი.
    მეთოდმა უნდა დაბეჭდოს ფასდაკლებული ფასი. შექმენით სხვა კლასი, რომელიც მემკვიდრეობით მიიღებს კლასს რომელშიც ეს x მეთოდი იმყოფება.
    მეთოდს არგუმენტები გადაეცით შვილობილ კლასში, უნდა დაიბეჭდოს ორი ვარიანტი:
    1. საწყისი ფასი 100, ფასდაკლების პროცენტი 5;
    2. საწყისიფასი 200, ფასდაკლების პროცენტი 10;
    Hint: პროცენტის რიცხვში გადასაყვანად პროცენტი უნდა გავყოთ 100-ზე

    */

    public double calculateDiscountPrice(double price, double percent) {
        double discountAmount = price * (percent / 100);
        return price - discountAmount;
    }
}
